# Напишите программу, которая будет преобразовывать десятичное число в двоичное. 

decimal = int(input('Введите десятичное число: '))

binary = bin(decimal)

print('Двоичное представление числа:', binary)